[
  {
    "key": "low",
    "name": "DJ Low",
    "social": {
      "soundcloud": "https://soundcloud.com/dj-low-15",
      "facebook": "https://www.facebook.com/djlowdnb/",
      "aor": "https://soundcloud.com/riddimrecordsuk/aor-dj-low-promo"
    },
    "info": ["DJ Low, a prominent figure in the upcoming drum and bass artist community, has risen through the ranks to be one of Cardiff's most well-known DJs. With an incredible ear for the fast-paced genre, Low has made an appearance at nearly every drum and bass night in Cardiff and has recently gained a place with the Major Bass team as a regular DJ.", "Joining the ranks of the Riddim Records artist collective in 2017, DJ Low has represented the brand up and down the UK and will continue to tear up dance-floors for the foreseeable future."],
    "pic": "../images/artists/LowSquare.jpg"
  },
  {
    "key": "mascot",
    "name": "Mascot",
    "social": {
      "soundcloud": "https://soundcloud.com/djmascot",
      "facebook": "https://www.facebook.com/mascotmusic/",
      "instagram": "https://instagram.com/mascotdnb",
      "aor": "https://soundcloud.com/riddimrecordsuk/aor-mascot-promo"
    },
    "info": ["Hailing from Cardiff, Max Scott aka Mascot began his journey into the world of drum and bass at an early age. Gripped by the sounds of his inspirations Ed Rush & Calyx and Teebee, the Welshman's passion for music spilled over into DJing in his early teens. Now recognized for his signature blend of deep n' dark dnb, Mascot consistently brings an electric energy to his performances.", "Mascot's versatility as a DJ has allowed him to support some of drum and bass's finest and most established talents, notably; Alix Perez, Bou, Emperor, Hybrid Minds, Kasra, Kings of the Rollers, Lenzman, Levela, LSB, Macky Gee & Phantasy.", "Pursuing his passion for the fast-paced genre even further, Mascot began designing his own brand Riddim Records. The company launched in 2016 and has gone from strength-to-strength to quickly become one of the UK's fastest growing independent drum and bass brands. With performances across the UK and internationally, Riddim Records has already left an imprint on the scene, laying a strong foundation for future success with sights set high among the biggest and best drum and bass brands", "For bookings, please contact: Ben@riddimrecords.co.uk"],
    "pic": "../images/artists/MascotSquare.jpg"
  },
  {
    "key": "mowgli",
    "name": "Mowgli",
    "social": {
      "soundcloud": "https://soundcloud.com/djmowgli1",
      "facebook": "https://www.facebook.com/Mowgli-304202320238348/",
      "aor": "https://soundcloud.com/riddimrecordsuk/aor-mowgli-promo"
    },
    "info": ["For a relatively small city, Cardiff has churned out some incredible drum and bass artists and Mowgli firmly holds his spot among some of the greatest. Drum and bass has played a pivotal role in Mowgli's life, and, equally, Mowgli has played a pivotal role in the shaping of the Cardiff drum and bass community. With his routes based in dark rollers, and taking influence from a dark and tech-y sound, Mowgli brings a whole new style to his sets.", "Joining the ranks of the Riddim Records artist collective in 2017, Mowgli has represented the brand both up and down the UK and internationally, and will continue to tear up dancefloors for the foreseeable future."],
    "pic": "../images/artists/MowgliSquare.jpg"
  },
  {
    "key": "rous",
    "name": "Rous",
    "social": {
      "soundcloud": "https://soundcloud.com/rous-2",
      "facebook": "https://www.facebook.com/TerraFirmaSound/",
      "aor": "https://soundcloud.com/riddimrecordsuk/aor-rous-promo"
    },
    "info": ["Warren Rousseau aka Rous is a Kent-born DJ and producer. Rous has developed an impressive skillset in his short career, successfully carving out his brand and passion for all things drum and bass.", "With a rich background in metal and rock it was inevitable that music was going to play a pivotal role in Rous' future. Rous discovered drum and bass through Netsky's 'I Refuse' at age 13 and with his eyes and ears opened, he entered himself into the world of drum and bass. Since then he's co-founded one of the most exciting new labels Terra Firma, gaining support from across the scene.", "Rous is a formidable figure behind the decks having supported the likes of Halogenix, Loz Contreras, Plastician, Taiki-Nulight and many more. Rous is certainly no stranger to smashing up dancefloors."],
    "pic": "../images/artists/RousSquare.jpg"
  },
  {
    "key": "hannahlux",
    "name": "Hannah Lux",
    "social": {
      "soundcloud": "https://soundcloud.com/hannah-lux"
    },
    "info": ["Self-taught singer, songwriter and musician, Hannah Lux, has been mesmerised by music her entire life and began writing her own at the age of 12; inspired by her colourful upbringing in Cardiff, the creative heart of Wales.", "Lux continued to write and perform throughout her teenage years and her style continuously evolved until she was introduced to electronic music. Her first track was an ambient garage collaboration, 'Dangerous', under her previous pseudonym, Solis, which attracted attention to her unique vocals. She took this in her stride, working behind the scenes on varied pieces with producers from around the UK before releasing 'Go With Me' - an original song remixed by Boston on Symmetry Recordings. Lux then flew to Amsterdam and Poland to record and film for 'We are not Human' with June Miller on RAM Records under her new pseudonym, Hannah Lux. 'We are not Human' is featured on UKF's Youtube platform and quickly became a liquid favourite leading to its nomination for the Best Music Video Award at the Bass Awards 2015 and its Top-5 spot in the Beatport chart."],
    "pic": "../images/artists/HannahSquare.jpg"
  },
  {
    "key": "reload",
    "name": "Reload",
    "social": {
      "soundcloud": "https://soundcloud.com/jdreload",
      "facebook": "https://www.facebook.com/djreloadwales/",
      "aor": "https://soundcloud.com/riddimrecordsuk/aor-reload-promo"
    },
    "info": ["Since his explosion into the drum and bass scene in 2016, Reload has quickly established himself as one of Cardiff's finest and highest demand DJs. The high-energy artist has built himself an impressive portfolio through supporting some of drum and bass's most well-known artists, taking up a residency at nearly every drum and bass brand in the Welsh capital.", "Joining the ranks of the Riddim Records artist collective in 2017, Reload has represented the brand up and down the UK and will continue to tear up dance-floors for the foreseeable future."],
    "pic": "../images/artists/ReloadSquare.jpg"
  },
  {
    "key": "ebbens",
    "name": "Ebbens",
    "social": {
      "soundcloud": "https://soundcloud.com/lukeebbens",
      "facebook": "https://www.facebook.com/ebbensdj/",
      "aor": "https://soundcloud.com/riddimrecordsuk/aor-ebbens-promo"
    },
    "info": ["Being the youngest artist in Riddim's artist collective has not stopped Ebbens from being one of its most prolific artists. With a plethora of experience, coupled with a skill that would compete with even the most experienced DJs - the name Ebbens is an institution of the Riddim Records family.", "Joining the ranks of the Riddim Records artist collective in 2017, as well being one of Riddim's in-house promoters, Ebbens has represented the brand both up and down the UK and internationally, and will continue to tear up dancefloors for the foreseeable future."],
    "pic": "../images/artists/EbbensSquare.jpg"
  },
  {
    "key": "skinny",
    "name": "Skinny",
    "social": {
      "soundcloud": "https://soundcloud.com/skiinnypete",
      "facebook": "https://www.facebook.com/soundsoftheskin/",
      "instagram": "https://www.instagram.com/skinnydnb/"
    },
    "info": ["Hailing from London, Skinny has played across almost all venues in Leeds, so is no stranger behind the decks. Providing a unique style of drum and bass that incorporates elements of minimal, half-time, rollers and jungle, he has crafted a sound that brings out the raver in every listener. His influences range from established artists across many genres, ranging from Alix Perez through to DJ Shadow and Mala. His sound control and crowd reading allows him to bring out heavy and dark sets where needed whilst also keeping the audience afloat with gentler liquid and technical minimal. When showing his experimental side, he dips into unknown and old school fields of drum and bass to bring out his own hand-picked selections.", "The roster of artists he has supported includes: Randall, DJ Hype, DJ Hazard, Ed Solo, Nicky Blackmarket, Gold Dubs, Benny L, Annix, Aries, Sub Zero, Serum, Dillinja and many more. In supporting these artists he has picked up unique skills that have allowed him to curate powerful sets that guarantee enjoyment. As well as having an ear for drum and bass, Skinny also delves into 140 dub – engaging in multiple projects with close friends and musicians curating new styles of dub and producing experimental sounds."],
    "pic": "../images/artists/SkinnySquare.jpg"
  },
  {
    "key": "mcxl",
    "name": "MC XL",
    "social": {
      "soundcloud": "https://soundcloud.com/xlmc",
      "facebook": "https://www.facebook.com/mcxldnb/",
      "instagram": "https://www.instagram.com/xl_mc/"
    },
    "info": ["Resident Host @ Aperture / Bedlam / Bullion / Diffrent / Submerge / Skankandbass / Shelter / Spindoctors / Riddim Records / Temple"],
    "pic": "../images/artists/McXLSquare.jpg"
  }

]